; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-34)
(:domain gripper-strips)
(:objects rooma roomb room3 room4 room5 left right ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 ball16 ball17 ball18 ball19 ball20 ball21 ball22 ball23 ball24 ball25 ball26 ball27 ball28 ball29 ball30 ball31 ball32 ball33 ball34 )
(:init
(room rooma)
(room roomb)
(room room3)
(room room4)
(room room5)
(gripper left)
(gripper right)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(ball ball10)
(ball ball11)
(ball ball12)
(ball ball13)
(ball ball14)
(ball ball15)
(ball ball16)
(ball ball17)
(ball ball18)
(ball ball19)
(ball ball20)
(ball ball21)
(ball ball22)
(ball ball23)
(ball ball24)
(ball ball25)
(ball ball26)
(ball ball27)
(ball ball28)
(ball ball29)
(ball ball30)
(ball ball31)
(ball ball32)
(ball ball33)
(ball ball34)
(free left)
(free right)
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 rooma)
(at ball7 roomb)
(at ball8 roomb)
(at ball9 roomb)
(at ball10 roomb)
(at ball11 roomb)
(at ball12 room3)
(at ball13 room3)
(at ball14 room3)
(at ball15 room3)
(at ball16 room3)
(at ball17 room3)
(at ball18 room3)
(at ball19 room3)
(at ball20 room3)
(at ball21 room3)
(at ball22 room3)
(at ball23 room3)
(at ball24 room3)
(at ball25 room4)
(at ball26 room4)
(at ball27 room4)
(at ball28 room4)
(at ball29 room4)
(at ball30 room4)
(at ball31 room5)
(at ball32 room5)
(at ball33 room5)
(at ball34 room5)
(at-robby rooma)
)
(:goal
(and
(at ball1 room5)
(at ball2 room5)
(at ball3 room5)
(at ball4 room5)
(at ball5 room5)
(at ball6 room5)
(at ball7 room5)
(at ball8 room5)
(at ball9 room5)
(at ball10 room5)
(at ball11 room5)
(at ball12 room5)
(at ball13 room5)
(at ball14 room5)
(at ball15 room5)
(at ball16 room5)
(at ball17 room5)
(at ball18 room5)
(at ball19 room5)
(at ball20 room5)
(at ball21 room5)
(at ball22 room5)
(at ball23 room5)
(at ball24 room5)
(at ball25 room5)
(at ball26 room5)
(at ball27 room5)
(at ball28 room5)
(at ball29 room5)
(at ball30 room5)
(at ball31 room5)
(at ball32 room5)
(at ball33 room5)
(at ball34 room5)
)
)
)

; plan
1. (pick ball6 rooma left)
   deleted: (at ball6 rooma) (free left)
   added: (carry ball6 left)
   goals met: 4 of 34
2. (pick ball5 rooma right)
   deleted: (at ball5 rooma) (free right)
   added: (carry ball5 right)
   goals met: 4 of 34
3. (move rooma room5)
   deleted: (at-robby rooma)
   added: (at-robby room5)
   goals met: 4 of 34
4. (drop ball5 room5 right)
   deleted: (carry ball5 right)
   added: (at ball5 room5) (free right)
   goals met: 5 of 34
5. (drop ball6 room5 left)
   deleted: (carry ball6 left)
   added: (at ball6 room5) (free left)
   goals met: 6 of 34
6. (move room5 roomb)
   deleted: (at-robby room5)
   added: (at-robby roomb)
   goals met: 6 of 34
7. (pick ball9 roomb left)
   deleted: (at ball9 roomb) (free left)
   added: (carry ball9 left)
   goals met: 6 of 34
8. (pick ball8 roomb right)
   deleted: (at ball8 roomb) (free right)
   added: (carry ball8 right)
   goals met: 6 of 34
9. (move roomb room5)
   deleted: (at-robby roomb)
   added: (at-robby room5)
   goals met: 6 of 34
10. (drop ball8 room5 right)
   deleted: (carry ball8 right)
   added: (at ball8 room5) (free right)
   goals met: 7 of 34
11. (drop ball9 room5 left)
   deleted: (carry ball9 left)
   added: (at ball9 room5) (free left)
   goals met: 8 of 34
12. (move room5 roomb)
   deleted: (at-robby room5)
   added: (at-robby roomb)
   goals met: 8 of 34
13. (pick ball7 roomb left)
   deleted: (at ball7 roomb) (free left)
   added: (carry ball7 left)
   goals met: 8 of 34
14. (pick ball11 roomb right)
   deleted: (at ball11 roomb) (free right)
   added: (carry ball11 right)
   goals met: 8 of 34
15. (move roomb room5)
   deleted: (at-robby roomb)
   added: (at-robby room5)
   goals met: 8 of 34
16. (drop ball11 room5 right)
   deleted: (carry ball11 right)
   added: (at ball11 room5) (free right)
   goals met: 9 of 34
17. (drop ball7 room5 left)
   deleted: (carry ball7 left)
   added: (at ball7 room5) (free left)
   goals met: 10 of 34
18. (move room5 roomb)
   deleted: (at-robby room5)
   added: (at-robby roomb)
   goals met: 10 of 34
19. (pick ball10 roomb left)
   deleted: (at ball10 roomb) (free left)
   added: (carry ball10 left)
   goals met: 10 of 34
20. (move roomb room5)
   deleted: (at-robby roomb)
   added: (at-robby room5)
   goals met: 10 of 34
21. (drop ball10 room5 left)
   deleted: (carry ball10 left)
   added: (at ball10 room5) (free left)
   goals met: 11 of 34
22. (move room5 room4)
   deleted: (at-robby room5)
   added: (at-robby room4)
   goals met: 11 of 34
23. (pick ball30 room4 left)
   deleted: (at ball30 room4) (free left)
   added: (carry ball30 left)
   goals met: 11 of 34
24. (pick ball29 room4 right)
   deleted: (at ball29 room4) (free right)
   added: (carry ball29 right)
   goals met: 11 of 34
25. (move room4 room5)
   deleted: (at-robby room4)
   added: (at-robby room5)
   goals met: 11 of 34
26. (drop ball29 room5 right)
   deleted: (carry ball29 right)
   added: (at ball29 room5) (free right)
   goals met: 12 of 34
27. (drop ball30 room5 left)
   deleted: (carry ball30 left)
   added: (at ball30 room5) (free left)
   goals met: 13 of 34
28. (move room5 room4)
   deleted: (at-robby room5)
   added: (at-robby room4)
   goals met: 13 of 34
29. (pick ball28 room4 left)
   deleted: (at ball28 room4) (free left)
   added: (carry ball28 left)
   goals met: 13 of 34
30. (pick ball27 room4 right)
   deleted: (at ball27 room4) (free right)
   added: (carry ball27 right)
   goals met: 13 of 34
31. (move room4 room5)
   deleted: (at-robby room4)
   added: (at-robby room5)
   goals met: 13 of 34
32. (drop ball27 room5 right)
   deleted: (carry ball27 right)
   added: (at ball27 room5) (free right)
   goals met: 14 of 34
33. (drop ball28 room5 left)
   deleted: (carry ball28 left)
   added: (at ball28 room5) (free left)
   goals met: 15 of 34
34. (move room5 room4)
   deleted: (at-robby room5)
   added: (at-robby room4)
   goals met: 15 of 34
35. (pick ball26 room4 left)
   deleted: (at ball26 room4) (free left)
   added: (carry ball26 left)
   goals met: 15 of 34
36. (pick ball25 room4 right)
   deleted: (at ball25 room4) (free right)
   added: (carry ball25 right)
   goals met: 15 of 34
37. (move room4 room5)
   deleted: (at-robby room4)
   added: (at-robby room5)
   goals met: 15 of 34
38. (drop ball25 room5 right)
   deleted: (carry ball25 right)
   added: (at ball25 room5) (free right)
   goals met: 16 of 34
39. (drop ball26 room5 left)
   deleted: (carry ball26 left)
   added: (at ball26 room5) (free left)
   goals met: 17 of 34
40. (move room5 room3)
   deleted: (at-robby room5)
   added: (at-robby room3)
   goals met: 17 of 34
41. (pick ball24 room3 left)
   deleted: (at ball24 room3) (free left)
   added: (carry ball24 left)
   goals met: 17 of 34
42. (pick ball23 room3 right)
   deleted: (at ball23 room3) (free right)
   added: (carry ball23 right)
   goals met: 17 of 34
43. (move room3 room5)
   deleted: (at-robby room3)
   added: (at-robby room5)
   goals met: 17 of 34
44. (drop ball23 room5 right)
   deleted: (carry ball23 right)
   added: (at ball23 room5) (free right)
   goals met: 18 of 34
45. (drop ball24 room5 left)
   deleted: (carry ball24 left)
   added: (at ball24 room5) (free left)
   goals met: 19 of 34
46. (move room5 room3)
   deleted: (at-robby room5)
   added: (at-robby room3)
   goals met: 19 of 34
47. (pick ball22 room3 left)
   deleted: (at ball22 room3) (free left)
   added: (carry ball22 left)
   goals met: 19 of 34
48. (pick ball21 room3 right)
   deleted: (at ball21 room3) (free right)
   added: (carry ball21 right)
   goals met: 19 of 34
49. (move room3 room5)
   deleted: (at-robby room3)
   added: (at-robby room5)
   goals met: 19 of 34
50. (drop ball21 room5 right)
   deleted: (carry ball21 right)
   added: (at ball21 room5) (free right)
   goals met: 20 of 34
51. (drop ball22 room5 left)
   deleted: (carry ball22 left)
   added: (at ball22 room5) (free left)
   goals met: 21 of 34
52. (move room5 room3)
   deleted: (at-robby room5)
   added: (at-robby room3)
   goals met: 21 of 34
53. (pick ball20 room3 left)
   deleted: (at ball20 room3) (free left)
   added: (carry ball20 left)
   goals met: 21 of 34
54. (pick ball19 room3 right)
   deleted: (at ball19 room3) (free right)
   added: (carry ball19 right)
   goals met: 21 of 34
55. (move room3 room5)
   deleted: (at-robby room3)
   added: (at-robby room5)
   goals met: 21 of 34
56. (drop ball19 room5 right)
   deleted: (carry ball19 right)
   added: (at ball19 room5) (free right)
   goals met: 22 of 34
57. (drop ball20 room5 left)
   deleted: (carry ball20 left)
   added: (at ball20 room5) (free left)
   goals met: 23 of 34
58. (move room5 room3)
   deleted: (at-robby room5)
   added: (at-robby room3)
   goals met: 23 of 34
59. (pick ball18 room3 left)
   deleted: (at ball18 room3) (free left)
   added: (carry ball18 left)
   goals met: 23 of 34
60. (pick ball17 room3 right)
   deleted: (at ball17 room3) (free right)
   added: (carry ball17 right)
   goals met: 23 of 34
61. (move room3 room5)
   deleted: (at-robby room3)
   added: (at-robby room5)
   goals met: 23 of 34
62. (drop ball17 room5 right)
   deleted: (carry ball17 right)
   added: (at ball17 room5) (free right)
   goals met: 24 of 34
63. (drop ball18 room5 left)
   deleted: (carry ball18 left)
   added: (at ball18 room5) (free left)
   goals met: 25 of 34
64. (move room5 room3)
   deleted: (at-robby room5)
   added: (at-robby room3)
   goals met: 25 of 34
65. (pick ball16 room3 left)
   deleted: (at ball16 room3) (free left)
   added: (carry ball16 left)
   goals met: 25 of 34
66. (pick ball15 room3 right)
   deleted: (at ball15 room3) (free right)
   added: (carry ball15 right)
   goals met: 25 of 34
67. (move room3 room5)
   deleted: (at-robby room3)
   added: (at-robby room5)
   goals met: 25 of 34
68. (drop ball15 room5 right)
   deleted: (carry ball15 right)
   added: (at ball15 room5) (free right)
   goals met: 26 of 34
69. (drop ball16 room5 left)
   deleted: (carry ball16 left)
   added: (at ball16 room5) (free left)
   goals met: 27 of 34
70. (move room5 room3)
   deleted: (at-robby room5)
   added: (at-robby room3)
   goals met: 27 of 34
71. (pick ball14 room3 left)
   deleted: (at ball14 room3) (free left)
   added: (carry ball14 left)
   goals met: 27 of 34
72. (pick ball13 room3 right)
   deleted: (at ball13 room3) (free right)
   added: (carry ball13 right)
   goals met: 27 of 34
73. (move room3 room5)
   deleted: (at-robby room3)
   added: (at-robby room5)
   goals met: 27 of 34
74. (drop ball13 room5 right)
   deleted: (carry ball13 right)
   added: (at ball13 room5) (free right)
   goals met: 28 of 34
75. (drop ball14 room5 left)
   deleted: (carry ball14 left)
   added: (at ball14 room5) (free left)
   goals met: 29 of 34
76. (move room5 room3)
   deleted: (at-robby room5)
   added: (at-robby room3)
   goals met: 29 of 34
77. (pick ball12 room3 left)
   deleted: (at ball12 room3) (free left)
   added: (carry ball12 left)
   goals met: 29 of 34
78. (move room3 room5)
   deleted: (at-robby room3)
   added: (at-robby room5)
   goals met: 29 of 34
79. (drop ball12 room5 left)
   deleted: (carry ball12 left)
   added: (at ball12 room5) (free left)
   goals met: 30 of 34
80. (move room5 rooma)
   deleted: (at-robby room5)
   added: (at-robby rooma)
   goals met: 30 of 34
81. (pick ball4 rooma left)
   deleted: (at ball4 rooma) (free left)
   added: (carry ball4 left)
   goals met: 30 of 34
82. (pick ball3 rooma right)
   deleted: (at ball3 rooma) (free right)
   added: (carry ball3 right)
   goals met: 30 of 34
83. (move rooma room5)
   deleted: (at-robby rooma)
   added: (at-robby room5)
   goals met: 30 of 34
84. (drop ball3 room5 right)
   deleted: (carry ball3 right)
   added: (at ball3 room5) (free right)
   goals met: 31 of 34
85. (drop ball4 room5 left)
   deleted: (carry ball4 left)
   added: (at ball4 room5) (free left)
   goals met: 32 of 34
86. (move room5 rooma)
   deleted: (at-robby room5)
   added: (at-robby rooma)
   goals met: 32 of 34
87. (pick ball2 rooma left)
   deleted: (at ball2 rooma) (free left)
   added: (carry ball2 left)
   goals met: 32 of 34
88. (pick ball1 rooma right)
   deleted: (at ball1 rooma) (free right)
   added: (carry ball1 right)
   goals met: 32 of 34
89. (move rooma room5)
   deleted: (at-robby rooma)
   added: (at-robby room5)
   goals met: 32 of 34
90. (drop ball2 room5 left)
   deleted: (carry ball2 left)
   added: (at ball2 room5) (free left)
   goals met: 33 of 34
91. (drop ball1 room5 right)
   deleted: (carry ball1 right)
   added: (at ball1 room5) (free right)
   goals met: 34 of 34
